Revit 2026 API

# FamilyItemFactoryNewLoftForm Method

---

Create new Form element by Loft operation, and add it into the Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Form NewLoftForm(
	bool isSolid,
	ReferenceArrayArray profiles
)
```
```vb
Public Function NewLoftForm (
	isSolid As Boolean,
	profiles As ReferenceArrayArray
) As Form
```
```cpp
public:
Form^ NewLoftForm(
	bool isSolid,
	ReferenceArrayArray^ profiles
)
```
```fsharp
member NewLoftForm :
        isSolid : bool *
        profiles : ReferenceArrayArray -> Form
```

#### Parameters

isSolid Boolean
    Indicates if the Form is Solid or Void.
profiles ReferenceArrayArray
    The profile set of the newly created loft. Each profile should consist of only one curve loop.

#### Return Value

FormIf creation was successful form is are returned.

#### Reference

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace